In [1]:
import pandas as pd

In [2]:
path = 'shopping_data.csv'
df = pd.read_csv(path)

In [3]:
df.head()

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [4]:
df.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [5]:
df.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [6]:
for column in df.columns:
    print(f'column {column} has {df[column].isnull().sum()} number of null values')

column CustomerID has 0 number of null values
column Card Member has 2 number of null values
column Age has 2 number of null values
column Annual Income has 0 number of null values
column Spending Score (1-100) has 1 number of null values

In [9]:
df.shape

(203, 5)

In [8]:
drop_df = df.dropna()
drop_df.shape

(200, 5)

In [10]:
print(f'duplicate row number is {drop_df.duplicated().sum()}')

duplicate row number is 0

In [11]:
clean_df = drop_df.drop('CustomerID',axis=1)
clean_df.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [12]:
def change(value):
    if value=='Yes':
        return 1
    else:
        return 0

In [13]:
clean_df['Card Member']=clean_df['Card Member'].apply(change)
clean_df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [14]:
clean_df['Annual Income'] = clean_df['Annual Income']/1000
clean_df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0           15.0                    39.0
1            1  21.0           15.0                    81.0
2            0  20.0           16.0                     6.0
3            0  23.0           16.0                    77.0
4            0  31.0           17.0                    40.0

In [15]:
clean_df.rename(columns = {'Card Member':'Card_Member','Annual Income':'Annual_Income','Spending Score (1-100)':'Spending_Score'}, inplace = True)

In [16]:
clean_df.head()

   Card_Member   Age  Annual_Income  Spending_Score
0            1  19.0           15.0            39.0
1            1  21.0           15.0            81.0
2            0  20.0           16.0             6.0
3            0  23.0           16.0            77.0
4            0  31.0           17.0            40.0

In [17]:
out_path='clean_shop_data.csv'
clean_df.to_csv(out_path)